[A_CelestialArmor_Buff H7BaseBuff]
mName="Небесный доспех"
mTooltip="Поглощает до %special.val3 ед. урона.\nДействует, пока не будет поглощено указанное количество урона, или в течение %durnow хода(ов)."
[A_CleansingLight H7HeroAbility]
mName="Очищающий свет"
mTooltip="Мгновенно рассеивает наложенные на дружественный отряд негативные магические эффекты: %special1."
mTooltipMagicGuild="Мгновенно рассеивает негативные магические эффекты, наложенные на дружественный отряд."
mTooltipUpgraded="Мгновенно рассеивает негативные магические эффекты: %special1. Действует на все дружественные отряды в выбранной области 4x4."
mTooltipMagicGuildRankLine="рассеивает негативн. эффекты: %special1, затраты %ICON_MANA маны: %special4 ед."
[A_Blinded_Buff H7BaseBuff]
mName="Слепота"
mTooltip="Существо пропускает ход."
[A_ChosenOfTheLight_Buff H7BaseBuff]
mName="Избранник света"
mTooltip="%stat1 к %ICON_ATTACK атаке.\n%stat2 к %ICON_DEFENSE защите.\n%stat4 к %ICON_MORALE боевому духу.\n%stat3 к %ICON_LUCK удаче.\nСущества всегда наносят максимальный урон.\nДлительность (ходов): %durnow."
[A_ElrathsConviction H7HeroAbility]
mName="Упорство Эльрата"
mTooltip="Увеличивает %ICON_DEFENSE защиту на %buff.buff.stat1.norm и %ICON_LEADERSHIP лидерство на %buff.buff.stat2.norm в следующем бою."
mTooltipMagicGuild="Увеличивает %ICON_DEFENSE защиту и %ICON_LEADERSHIP лидерство героя в следующем бою."
mTooltipMagicGuildRankLine="%buff.buff.stat1 к %buff.buff.stat1.icon защите и %buff.buff.stat2 к %buff.buff.stat2.icon лидерству"
[A_ElrathsConviction_Buff H7BaseBuff]
mName="Упорство Эльрата"
mTooltip="%stat1 к %ICON_DEFENSE защите.\n%stat2 к %ICON_LEADERSHIP лидерству.\nДлительность (боев): %durnow."
[A_Retribution H7HeroAbility]
mName="Возмездие"
mTooltip="Наносит от %buff1.buff.d.min до %buff1.buff.d.max ед. урона от %buff1.buff.d.icon магии света любому существу, атакующему выбранный дружественный отряд. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuild="Наносит урон от %buff1.buff.d.icon магии света любому существу, атакующему выбранный дружественный отряд. Длительность (ходов): %buff1.buff.durini."
mTooltipUpgraded="%spell.name: теперь заклинание накладывается на все дружественные отряды в выбранной области 4x4. Любое существо, атакующее дружественный отряд под действием этого заклинания, получает от %buff1.buff.d.min до %buff1.buff.d.max ед. урона от %buff1.buff.d.icon магии света. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuildRankLine="от %buff1.buff.d.min до %buff1.buff.d.max ед. урона %buff1.buff.d.icon"
[A_Retribution_Buff H7BaseBuff]
mName="Возмездие"
mTooltip="Наносит от %d.min до %d.max ед. урона от %d.icon магии света любому существу, атакующему этот отряд. Длительность (ходов): %durnow."
[A_SunBeam H7HeroAbility]
mName="Солнечный луч"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии света."
mTooltipMagicGuild="Мгновенно наносит выбранному вражескому отряду урон от %d.icon магии света."
mTooltipUpgraded="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %ICON_LIGHT магии света и снижает его %ICON_ATTACK атаку и %ICON_DEFENSE защиту на %buff.buff.stat1.norm. Длительность (ходов): %buff.buff.durini."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %ICON_LIGHT"
[A_SunBurst H7HeroAbility]
mName="Солнечная вспышка"
mTooltip="Из выбранной свободной клетки в 8 направлениях расходятся лучи, которые наносят от %d.min до %d.max ед. урона от %d.icon магии света попавшим под их действие вражеским отрядам. Лучи не проникают сквозь существ и препятствия. Каждый отряд получает урон только от одного луча."
mTooltipMagicGuild="Из выбранной свободной клетки в 8 направлениях расходятся лучи, которые наносят урон от %d.icon магии света вражеским отрядам. Лучи не проникают сквозь существ и препятствия. Каждый отряд получает урон только от одного луча."
mTooltipUpgraded="Из выбранной свободной клетки в 8 направлениях расходятся лучи, которые наносят вражеским отрядам от %d.min до %d.max ед. урона от %ICON_LIGHT магии света и снижают их %ICON_ATTACK атаку и %ICON_DEFENSE защиту на %buff.buff.stat1.norm. Длительность (ходов): %buff.buff.durini. Лучи не проникают сквозь существ и препятствия. Каждый отряд получает урон только от одного луча."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %ICON_LIGHT"
[Imprinted.A_CelestialArmor_Imprinted H7HeroAbility]
mName="Небесный доспех"
mTooltip="Поглощает до %buff1.buff.special.val1 ед. урона, получаемого выбранным дружественным отрядом. Длительность (ходов): %buff1.buff.durini."
[Imprinted.A_CelestialArmor_Imprinted_Buff H7BaseBuff]
mName="Небесный доспех"
mTooltip="Поглощает до %special.val3 ед. урона.\nДействует, пока не будет поглощено указанное количество урона, или в течение %durnow хода(ов)."
[Imprinted.A_Resurrection_Imprinted H7HeroAbility]
mName="Воскрешение"
mTooltip="Мгновенно восстанавливает %d.min ед. здоровья выбранному дружественному отряду и возвращает к жизни погибших существ. Существа в соседних дружественных отрядах также возвращаются к жизни и восстанавливают %buff1.buff.d.min ед. здоровья в течение %buff1.buff.durini хода(ов).\n(Не действует на нежить и конструктов)."
[Imprinted.A_SummonGoldDragon_Imprinted H7HeroAbility]
mName="Призыв золотых драконов"
mTooltip="Призывает в выбранную область 2x2 золотых драконов – %special.val1 сущ."
[Imprinted.A_SunBeam_Imprinted H7HeroAbility]
mTooltipMagicGuild="Мгновенно наносит выбранному вражескому отряду урон от %d.icon магии света."
mTooltipUpgraded="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии света. С вероятностью %buff.chance/% дальность перемещения и показатель защиты атакованного отряда снижаются до конца следующего хода."
mName="Солнечный луч"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии света."
[Imprinted.A_SunBurst_Imprinted H7HeroAbility]
mName="Солнечная вспышка"
mTooltip="Из выбранной свободной клетки в 8 направлениях расходятся лучи, которые наносят от %d.min до %d.max ед. урона от %d.icon магии света попавшим под их действие вражеским отрядам. Лучи не проникают сквозь существ и препятствия. Каждый отряд получает урон только от одного луча."
[A_Bedazzled_Buff H7BaseBuff]
mName="Потрясение"
mTooltip="%stat1 к %ICON_ATTACK атаке.\n%stat2 к %ICON_DEFENSE защите.\nДлительность (ходов): %durnow."
[A_Bedazzled_FromCreature_Buff_Elite H7BaseBuff]
mName="Потрясение"
mTooltip="%stat1 к %ICON_ATTACK атаке.\n%stat2 к %ICON_DEFENSE защите.\nДлительность (ходов): %durnow."
[A_Bedazzled_FromCreature_Buff_Champion H7BaseBuff]
mName="Потрясение"
mTooltip="%stat1 к %ICON_ATTACK атаке.\n%stat2 к %ICON_DEFENSE защите.\nДлительность (ходов): %durnow."
[A_Retribution_Buff_Upgraded H7BaseBuff]
mName="Возмездие"
mTooltip="Наносит от %d.min до %d.max ед. урона от %d.icon магии света любому существу, атакующему этот отряд. Длительность (ходов): %durnow."
[A_Resurrection_Buff H7BaseBuff]
mName="Прикосновение Эльрата"
mTooltip="Восстанавливает %d.min ед. здоровья всем находящимся поблизости дружественным отрядам в начале их хода и возвращает к жизни погибших существ.\n(Не действует на нежить и конструктов).\nДействует в течение %durnow хода(ов)."
[Imprinted.A_Resurrection_Imprinted_Buff H7BaseBuff]
mName="Прикосновение Эльрата"
mTooltip="Восстанавливает %d.min ед. здоровья всем находящимся поблизости дружественным отрядам в начале их хода и возвращает к жизни погибших существ.\n(Не действует на нежить и конструктов).\nДействует в течение %durnow хода(ов)."
[Imprinted.A_CleansingLight_Imprinted H7HeroAbility]
mName="Очищающий свет"
mTooltip="Мгновенно рассеивает наложенные на дружественный отряд негативные магические эффекты: %special1."
[Imprinted.A_ElrathsConviction_Imprinted H7HeroAbility]
mName="Упорство Эльрата"
mTooltip="Увеличивает %ICON_DEFENSE защиту на %buff.buff.stat1.norm и %ICON_LEADERSHIP лидерство на %buff.buff.stat2.norm в следующем бою."
[Imprinted.A_ElrathsConviction_Imprinted_Buff H7BaseBuff]
mName="Упорство Эльрата"
mTooltip="%stat1 к %ICON_DEFENSE защите.\n%stat2 к %ICON_LEADERSHIP лидерству.\nДлительность (боев): %durnow."
[Imprinted.A_Retribution_Imprinted H7HeroAbility]
mName="Возмездие"
mTooltip="Наносит от %buff1.buff.d.min до %buff1.buff.d.max ед. урона от %buff1.buff.d.icon магии света любому существу, атакующему выбранный дружественный отряд. Длительность (ходов): %buff1.buff.durini."
[Imprinted.A_Retribution_Imprinted_Buff H7BaseBuff]
mName="Возмездие"
mTooltip="Наносит от %d.min до %d.max ед. урона от %d.icon магии света любому существу, атакующему этот отряд. Длительность (ходов): %durnow."
[Imprinted.A_SummonGoldDragon_Imprinted_Artifact H7HeroAbility]
mName="Призыв золотых драконов"
mTooltip="Призывает в выбранную область 2x2 золотых драконов – %special.val1 сущ."
[A_Martyr_Buff_MartyrAdoration H7BaseBuff]
mName="Аура мученика"
mTooltip="%stat к %icon_leadership боевому духу. Действует, пока на поле боя присутствует мученик."
[Imprinted.A_Martyr_Imprinted_Buff_MartyrAdoration H7BaseBuff]
mName="Аура мученика"
mTooltip="%stat к %icon_leadership боевому духу. Действует, пока на поле боя присутствует мученик."


UCP 1.1

[A_Martyr_Buff_Martyr H7BaseBuff]
mName="Мученик"
mTooltip="%buff1.buff.special1 урона, получаемого любым другим дружественным отрядом, перенаправляется этому существу. Длительность (раундов): %durnow."

[Imprinted.A_Martyr_Imprinted_Artifact H7HeroAbility]
mName="Мученик"
mTooltip="Выбранное дружественное существо становится мучеником. Каждый раз, когда союзники получают урон, %buff1.buff.buff1.buff.special1 этого урона перенаправляется мученику. Остальные дружественные отряды получают %buff1.buff.buff1.buff.stat к %icon_leadership боевому духу. Эффект длится в течение %buff1.buff.durini раунда(ов) или пока мученик не погибнет."

[Imprinted.A_Martyr_Imprinted_Buff_Martyr H7BaseBuff]
mName="Мученик"
mTooltip="%buff1.buff.special1 урона, получаемого любым другим дружественным отрядом, перенаправляется этому существу. Длительность (раундов): %durnow."

[Imprinted.A_Martyr_Imprinted H7HeroAbility]
mName="Мученик"
mTooltip="Выбранное дружественное существо становится мучеником. Каждый раз, когда союзники получают урон, %buff1.buff.buff1.buff.special1 этого урона перенаправляется мученику. Остальные дружественные отряды получают %buff1.buff.buff1.buff.stat к %icon_leadership боевому духу. Эффект длится в течение %buff1.buff.durini раунда(ов) или пока мученик не погибнет."

[Imprinted.A_Heal_Imprinted H7HeroAbility]
mName="Исцеление"
mTooltip="Мгновенно восстанавливает %d1.min ед. здоровья дружественному отряду и возвращает к жизни погибших существ.\n(Не действует на конструктов)."


UCP 1.1 New Effect

[Imprinted.A_Resurrection_Imprinted_Artefact H7HeroAbility]
mName="Воскрешение"
mTooltip="Мгновенно восстанавливает %d.min ед. здоровья выбранному дружественному отряду и возвращает к жизни погибших существ. Существа в соседних дружественных отрядах также возвращаются к жизни и восстанавливают %buff1.buff.d.min ед. здоровья в течение %buff1.buff.durini хода(ов).\n(Не действует на нежить и конструктов)."



7.5_mod :

[Rework.A_Burningdetermination H7HeroAbility]
mName="Небесный доспех"
mTooltip="Поглощает до %buff1.buff.special.val1 ед. урона, получаемого выбранным дружественным отрядом. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuild="Поглощает урон, получаемый выбранным дружественным отрядом. Длительность (ходов): %buff1.buff.durini."
mTooltipUpgraded="Поглощает до %buff1.buff.special.val1 ед. урона, получаемого всеми дружественными отрядами в выбранной области 3x3. Длительность (ходов): %buff1.buff.durini."
mTooltipMagicGuildRankLine="поглощ.: до %buff1.buff.special.val1 ед. урона"

[rework1.A_Regeneration H7HeroAbility]
mName="Исцеление"
mTooltip="Мгновенно восстанавливает %d1.min ед. здоровья дружественному отряду и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipMagicGuild="Мгновенно восстанавливает здоровье выбранному дружественному отряду и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipUpgraded="В выбранной области 4x4 мгновенно восстанавливает %d1.min ед. здоровья всех дружественных отрядов и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipMagicGuildRankLine="%d1.min ед. зд."

[Rework1.A_Burningdetermination H7HeroAbility]
mTooltipMagicGuild="Выбранное дружественное существо становится мучеником. Каждый раз, когда союзники получают урон, часть этого урона перенаправляется мученику. Остальные дружественные отряды получают %buff1.buff.buff1.buff.stat к %icon_leadership боевому духу. Эффект длится в течение %buff1.buff.durini раунда(ов) или пока мученик не погибнет."
mTooltipMagicGuildRankLine="Перенаправление урона: %buff1.buff.buff1.buff.special1."
mName="Мученик"
mTooltip="Выбранное дружественное существо становится мучеником. Каждый раз, когда союзники получают урон, %buff1.buff.buff1.buff.special1 этого урона перенаправляется мученику. Остальные дружественные отряды получают %buff1.buff.buff1.buff.stat к %icon_leadership боевому духу. Эффект длится в течение %buff1.buff.durini раунда(ов) или пока мученик не погибнет."

[Rework2.A_Regeneration H7HeroAbility]
mName="Воскрешение"
mTooltip="Мгновенно восстанавливает %d.min ед. здоровья выбранному дружественному отряду и возвращает к жизни погибших существ. Существа в соседних дружественных отрядах также возвращаются к жизни и восстанавливают %buff1.buff.d.min ед. здоровья в течение %buff1.buff.durini хода(ов).\n(Не действует на нежить и конструктов)."
mTooltipMagicGuild="Мгновенно восстанавливает здоровье выбранному дружественному отряду и возвращает к жизни погибших существ. Существа в соседних дружественных отрядах также возвращаются к жизни и восстанавливают здоровье в течение %buff1.buff.durini хода(ов).\n(Не действует на нежить и конструктов)."
mTooltipMagicGuildRankLine="восст. %d.min ед. зд. и еще %buff1.buff.d.min ед. зд. соседним отрядам"

[A_Heal_campag H7HeroAbility]
mName="Исцеление"
mTooltip="Мгновенно восстанавливает %d1.min ед. здоровья дружественному отряду и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipMagicGuild="Мгновенно восстанавливает здоровье выбранному дружественному отряду и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipUpgraded="В выбранной области 4x4 мгновенно восстанавливает %d1.min ед. здоровья всех дружественных отрядов и возвращает к жизни погибших существ.\n(Не действует на конструктов)."
mTooltipMagicGuildRankLine="%d1.min ед. зд."